## Plan Result (stg_rbac)




<pre><code>Plan: 12 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Crime Portal VM Admin Login (env:staging)-crime-portal-frontend-vm01-stg&#34;]
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Crime Portal VM Admin Login (env:staging)-crime-portal-frontend-vm02-stg&#34;]
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Crime Portal VM Login (env:staging)-crime-portal-frontend-vm01-stg&#34;]
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Crime Portal VM Login (env:staging)-crime-portal-frontend-vm02-stg&#34;]
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Platform Operations-crime-portal-frontend-vm01-stg&#34;]
  * azurerm_role_assignment.frontend_rbac[&#34;DTS Platform Operations-crime-portal-frontend-vm02-stg&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Crime Portal VM Admin Login (env:staging)-crime-portal-ldap-vm01-stg&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Crime Portal VM Admin Login (env:staging)-crime-portal-ldap-vm02-stg&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Crime Portal VM Login (env:staging)-crime-portal-ldap-vm01-stg&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Crime Portal VM Login (env:staging)-crime-portal-ldap-vm02-stg&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Platform Operations-crime-portal-ldap-vm01-stg&#34;]
  * azurerm_role_assignment.ldap_rbac[&#34;DTS Platform Operations-crime-portal-ldap-vm02-stg&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.frontend_rbac["DTS Crime Portal VM Admin Login (env:staging)-crime-portal-frontend-vm01-stg"] will be created
  + resource "azurerm_role_assignment" "frontend_rbac" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fcae01c5-38ff-4f41-9c26-9d327fb286df"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Administrator Login"
      + scope                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.frontend_rbac["DTS Crime Portal VM Admin Login (env:staging)-crime-portal-frontend-vm02-stg"] will be created
  + resource "azurerm_role_assignment" "frontend_rbac" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fcae01c5-38ff-4f41-9c26-9d327fb286df"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Administrator Login"
      + scope                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.frontend_rbac["DTS Crime Portal VM Login (env:staging)-crime-portal-frontend-vm01-stg"] will be created
  + resource "azurerm_role_assignment" "frontend_rbac" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1c605be7-8630-471b-bdd5-e0e7df2b488c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine User Login"
      + scope                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.frontend_rbac["DTS Crime Portal VM Login (env:staging)-crime-portal-frontend-vm02-stg"] will be created
  + resource "azurerm_role_assignment" "frontend_rbac" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1c605be7-8630-471b-bdd5-e0e7df2b488c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine User Login"
      + scope                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.frontend_rbac["DTS Platform Operations-crime-portal-frontend-vm01-stg"] will be created
  + resource "azurerm_role_assignment" "frontend_rbac" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Administrator Login"
      + scope                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm01-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.frontend_rbac["DTS Platform Operations-crime-portal-frontend-vm02-stg"] will be created
  + resource "azurerm_role_assignment" "frontend_rbac" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Administrator Login"
      + scope                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-frontend-vm02-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Crime Portal VM Admin Login (env:staging)-crime-portal-ldap-vm01-stg"] will be created
  + resource "azurerm_role_assignment" "ldap_rbac" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fcae01c5-38ff-4f41-9c26-9d327fb286df"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Administrator Login"
      + scope                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Crime Portal VM Admin Login (env:staging)-crime-portal-ldap-vm02-stg"] will be created
  + resource "azurerm_role_assignment" "ldap_rbac" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fcae01c5-38ff-4f41-9c26-9d327fb286df"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Administrator Login"
      + scope                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Crime Portal VM Login (env:staging)-crime-portal-ldap-vm01-stg"] will be created
  + resource "azurerm_role_assignment" "ldap_rbac" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1c605be7-8630-471b-bdd5-e0e7df2b488c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine User Login"
      + scope                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Crime Portal VM Login (env:staging)-crime-portal-ldap-vm02-stg"] will be created
  + resource "azurerm_role_assignment" "ldap_rbac" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1c605be7-8630-471b-bdd5-e0e7df2b488c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine User Login"
      + scope                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Platform Operations-crime-portal-ldap-vm01-stg"] will be created
  + resource "azurerm_role_assignment" "ldap_rbac" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Administrator Login"
      + scope                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm01-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.ldap_rbac["DTS Platform Operations-crime-portal-ldap-vm02-stg"] will be created
  + resource "azurerm_role_assignment" "ldap_rbac" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Administrator Login"
      + scope                            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Compute/virtualMachines/crime-portal-ldap-vm02-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":23,"Program":"tfcmt","SHA1":"","Target":"stg_rbac","Vars":{}} -->